{"id":4872,"token":"0351f8cb46fa","name":"Cho Than","header":"Cho Than is a 53-year-old seamstress and mother from Burma who needs $1,500 to treat a uterine myoma.","description":"Meet Cho Than, a 53-year-old seamstress and mother from Burma who enjoys planting vegetables in her garden. Known within her community for her generosity, Cho Than often gives the vegetables that she grows to her neighbors and friends.\r\n\r\nCho Than has a myoma, more commonly known as a uterine fibroid. Fibroids are benign tumors that grow within the muscle tissue of the uterus, or womb. They can be very small (invisible to the naked eye) or very large (melon-sized) and can present as a single mass or a cluster of several masses. An estimated 80 percent of women have uterine fibroids in their lifetime.\r\n\r\nWhile some women who have fibroids have no symptoms, others experience heavy periods, abdominal pain, or constipation. “Cho Than experiences severe pain in her back and lower abdomen,” shares our medical partner, Burma Border Projects (BBP). “She has difficulty urinating and it is painful for her to do so. Her condition makes it impossible for her to work and requires her daughter to care for her and support her financially.”\r\n\r\nThe recommended treatment for Cho Than is a total hysterectomy and oophorectomy (surgical removal of the uterus and ovaries). $1500 covers the cost of the surgery as well as a seven-day hospital stay and one outpatient appointment post-surgery.\r\n\r\n“With surgery, Cho Than will be able to live without pain,” reports BBP.\r\n\r\nCho Than looks forward to being healthy again and hopes to be able to return to work as a seamstress. She dreams of owning a small house where she and her daughter can live peacefully.","age":53,"country":"Burma","url":"https://watsi.org/profile/0351f8cb46fa-cho-than","badge_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4872/badge_BWMF_DawChoChoThan_F53_Myoma_PreOp1.JPG","profile_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4872/profile_BWMF_DawChoChoThan_F53_Myoma_PreOp1.JPG","per_cent_funded":"4%","target":"$1,500","target_to_go":"$1,430 to go","donated":"$70","number_of_donors":7}