{"id":4887,"token":"64e0d5871165","name":"Soe Win","header":"Soe Win is a young woman from Burma who needs $1,500 to treat a uterine myoma.","description":"\"Once I am healthy, I will be able to work hard and save money,\" Soe Win shares. \"I will try to donate to the needy. I can see a brighter future ahead of me. When the rain stops a rainbow will appear in its place.\"\r\n\r\nSoe Win is a 30-year-old woman from Burma who “likes to spend her time outside of work at the local monastery, helping the less fortunate any way she can,\" says our medical partner, Burma Border Projects (BBP).\r\n\r\nSoe Win has a uterine myoma -- a condition where uterine muscles develop abnormally and benign tumorous growths called fibroids grow within the uterus. The fibroids increase the pressure on the internal organs, causing abdominal pain.\r\n\r\n\"Soe Win cannot sleep well and it is difficult for her to stand up and sit down,\" says BBP. Due to this pain, “Soe Win is unable to walk more than a short distance.”\r\n\r\n“Since she lives alone,” BBP explains, “Soe Win worries that if she does not get better, there will be no one to take care of her.”\r\n\r\nThough she currently works as a laundress, her income is not enough to pay for the operation she needs.\r\n\r\nWith $1,500, Soe Win will receive a total hysterectomy—a procedure in which her uterus will be removed to prevent the fibroids from returning. “With surgery, Soe Win will not be in pain anymore, and she will be able to sleep well and move around much more easily,\" BBP adds.\r\n\r\nFollowing this procedure, Soe Win is looking forward to being healthy enough to work and go to the temple.\r\n","age":30,"country":"Burma","url":"https://watsi.org/profile/64e0d5871165-soe-win","badge_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4887/badge_BWMF_SoeWinAye_F30_Myoma_PreOp2.JPG","profile_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4887/profile_BWMF_SoeWinAye_F30_Myoma_PreOp2.JPG","per_cent_funded":"0%","target":"$1,500","target_to_go":"$1,495 to go","donated":"$5","number_of_donors":1}