{"id":4858,"token":"6660cdb2bf4f","name":"Scholasticah","header":"Scholasticah is a mother and flower farmer from Kenya who needs $790 to treat cervical cancer.","description":"Meet Scholasticah, a mother of five from Kenya. She and her husband are casual laborers at a flower farm. Their children are all in school except the first-born, who began assisting his parents at the flower farm following primary school.\r\n\r\nAfter concern surrounding her irregular discharge heightened, Scholasticah received a test and biopsy that showed early signs of cervical cancer. According to our medical partner, African Mission Healthcare Foundation (AMHF), “The doctor advised Scholasticah to undergo a total abdominal hysterectomy (TAH),” but due to her family’s low income, she was forced to postpone the treatment.\r\n\r\nFortunately, her doctor referred Scholasticah to Watsi. Scholasticah’s family’s $60 contribution will subsidize the treatment and the remaining $790 to be raised will cover a TAH—a surgical procedure that involves removing the uterus and cervix. The funding also includes labs, medication, post-operative care, and a five-day hospital stay. \r\n\r\nAMHF reports, “We expect that after surgery, the cancer will be halted. Scholasticah will be free from the risk of cancer spread and possible death. She will be able to work and raise her children.”\r\n\r\nWith the help of Watsi donors, Scholasticah is hopeful for the future: “I was devastated and my husband was worried when I was told I have cancer. I have been reassured that with this surgery, I can be safe. I really hope to get help and for my surgery to be successful so that the cancer spread can be halted.” ","age":46,"country":"Kenya","url":"https://watsi.org/profile/6660cdb2bf4f-scholasticah","badge_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4858/badge_Scolasticah_Syukau_Pre_op_picture_2_AMHF_Nazareth.JPG","profile_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4858/profile_Scolasticah_Syukau_Pre_op_picture_2_AMHF_Nazareth.JPG","per_cent_funded":"21%","target":"$790","target_to_go":"$620 to go","donated":"$170","number_of_donors":8}