{"id":4874,"token":"6d4aa5648dc9","name":"Ofelia","header":"Ofelia is a 61-year-old woman from Philippines who needs $525 to treat hyperthyroidism.","description":"Ofelia is a sociable 61-year-old woman from the Philippines. Our medical partner, International Care Ministries (ICM), shares, “Since all of her kids are already married, she devotes her time helping in the tasks in their local church.”\r\n\r\nThree years ago, Ofelia experienced sudden weight loss and was diagnosed with hyperthyroidism. This condition is caused by the overproduction of a hormone in the thyroid. According to ICM, “She experiences sore throat, choking sensation and palpitations often thus affecting her daily activities and her ministry in their church.”\r\n\r\nOfelia has undergone treatments in 2013 and 2014. However, her physician has now advised her to undergo a thyroidectomy—a surgery to remove the thyroid gland. Unfortunately, Ofelia and her husband cannot afford this treatment, as Ofelia does not work and her husband only earns $70 a month—barely enough for their daily expenses. ICM continues, “Her children also can't help with her surgery because they, too, have financial difficulties.”\r\n\r\nFor $525, we can help fund Ofelia’s thyroid surgery, providing medication and a three-day hospital stay as well. The surgery will help correct her hormonal imbalance and eliminate the symptoms and discomfort Ofelia is currently experiencing.\r\n\r\n“She is very excited to undergo surgery so that she can continue to serve in their local church and sing without any difficulty,” adds ICM.\r\n\r\n“I’m always praying that there could be somebody who could help me with my surgery. It would be a great help if you could be God’s instrument to answer my prayer,” shares Ofelia. ","age":61,"country":"Philippines","url":"https://watsi.org/profile/6d4aa5648dc9-ofelia","badge_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4874/badge_20150715_134802.jpg","profile_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4874/profile_20150715_134802.jpg","per_cent_funded":"3%","target":"$525","target_to_go":"$505 to go","donated":"$20","number_of_donors":2}