{"id":4862,"token":"9536f2dedde9","name":"John Bradley","header":"John Bradley is an eight-year-old boy from Haiti who needs $1,500 to treat severe respiratory distress.","description":"“John is a beautiful little boy living with his father,” shares our medical partner in Haiti, Project Medishare (PM). \r\n\r\nJust eight years old, John is in severe respiratory distress. “Twelve months ago John fell on a rock while biking in his neighborhood, and his parents did not take him to the hospital because they did not have money and it was not severe,” PM explains. “A few days later John started having difficulties breathing and his belly, face and foot started swelling.” When his father saw this, he took John to the hospital where he was given oxygen. However, pus in his right lung is still preventing him from breathing normally. \r\n\r\nIn order for John to recover, he must receive surgery to remove the pus. “John's father is working very hard to raise money for him,” PM tells us. “He has to walk under the hot sun of Haiti every day, selling used stuff.”\r\n\r\nJohn’s father shares, “I fix stuff I find to sell in order to get money to feed my kid. I only came to the hospital with John hoping to receive free care because he was very sick; when they said to me that it is a private hospital and that I have to pay, I thought about going back home because I have no money.  ”\r\n\r\nThankfully, John’s father does not have to take his son home. With $1,500 in funding, PM explains, “Treatment will consist of a thoracic drainage by surgical intervention.” First, the pus will be drained from John’s lung. Second, John will be given antibiotics to treat the infection. Finally, he will rejoin his family and resume his healthy life. \r\n\r\n“This surgery will save John’s life,” PM shares. Let’s fund this life-saving treatment and allow John to live a normal childhood—without pain and respiratory distress.","age":8,"country":"Haiti","url":"https://watsi.org/profile/9536f2dedde9-john-bradley","badge_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4862/badge_IMG_2412.JPG","profile_url":"https://d3w52z135jkm97.cloudfront.net/uploads/profile/image/4862/profile_IMG_2412.JPG","per_cent_funded":"11%","target":"$1,500","target_to_go":"$1,325 to go","donated":"$175","number_of_donors":17}